Repository: MarcDelrue/squad-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: fr

# userScreenTitle
source: User
fr: Utilisateur

# userNameLabel
source: User Name
fr: Nom d'utilisateur

# userNameValidation
source: Please enter a username
fr: Veuillez saisir un nom d'utilisateur

# selectRoleLabel
source: Select a Role
fr: Sélectionnez un rôle

# selectRoleValidation
source: Please select a role
fr: Veuillez sélectionner un rôle

source: Your color:
fr: Votre couleur :

source: Update
fr: Mettre à jour

source: Saving...
fr: Enregistrement...

source: Sign Out
fr: Se déconnecter

# confirmSignOutTitle
source: Confirm Sign Out
fr: Confirmer la déconnexion

# confirmSignOutBody
source: Are you sure you want to sign out?
fr: Êtes-vous sûr de vouloir vous déconnecter ?

source: Cancel
fr: Annuler

# profileUpdated
source: Successfully updated profile!
fr: Profil mis à jour avec succès !

# unexpectedRetrieveProfile
source: Unexpected error occurred while retrieving profile
fr: Erreur inattendue lors de la récupération du profil

# unexpectedUpdateProfile
source: Unexpected error occurred while updating profile
fr: Erreur inattendue lors de la mise à jour du profil

# unexpectedSignOut
source: Unexpected error occurred while signing out
fr: Erreur inattendue lors de la déconnexion

source: Language
fr: Langue

source: English
fr: Anglais

source: French
fr: Français

# tabUser
source: User
fr: Utilisateur

# tabSquads
source: Squads
fr: Escouades

# tabMap
source: Map
fr: Carte

# tooltipCompleteProfileSquads
source: Complete your profile to access Squads
fr: Complétez votre profil pour accéder aux Escouades

# tooltipCompleteProfileMap
source: Complete your profile to access Map
fr: Complétez votre profil pour accéder à la Carte

# tooltipCompleteProfileTracker
source: Complete your profile to access Tracker
fr: Complétez votre profil pour accéder au Tracker

# loginTitle
source: Login
fr: Connexion

# invalidSquadCode
source: Not a valid squad code
fr: Code d'escouade invalide

# scanSquadQrTitle
source: Scan Squad QR
fr: Scanner le QR de l'escouade

source: Retry
fr: Réessayer

source: Join
fr: Rejoindre

source: Kick User
fr: Exclure l'utilisateur

source: Set as Host
fr: Définir comme hôte

# confirmKickUserTitle
source: Confirm Kick User
fr: Confirmer l'exclusion

# confirmKickUserBody
source: Are you sure you want to kick {username}?
fr: Êtes-vous sûr de vouloir exclure {username} ?

# confirmSetHostTitle
source: Confirm Set Host
fr: Confirmer l'attribution d'hôte

# confirmSetHostBody
source: Are you sure you want to set {username} as the host?
fr: Êtes-vous sûr de vouloir définir {username} comme hôte ?

# confirmLeaveSquadTitle
source: Confirm Leave Squad
fr: Confirmer le départ de l'escouade

# confirmLeaveSquadBody
source: Are you sure you want to leave the squad?
fr: Êtes-vous sûr de vouloir quitter l'escouade ?

source: Kick
fr: Exclure

source: Set Host
fr: Définir l'hôte

source: Leave
fr: Quitter

source: Start game
fr: Démarrer la partie

source: End game
fr: Terminer la partie

source: Loading...
fr: Chargement...

source: Scan
fr: Scanner

source: Stop
fr: Arrêter

# stopScanTooltip
source: Stop scan
fr: Arrêter le scan

# nameFilterHint
source: Name filter (e.g. TTGO)
fr: Filtre de nom (ex : TTGO)

source: Disconnect
fr: Déconnecter

source: Connect
fr: Se connecter

source: Sync to Device
fr: Synchroniser avec l'appareil

# bluetoothPermanentlyDenied
source: Bluetooth permissions permanently denied
fr: Autorisations Bluetooth refusées définitivement

# failedToUpdateStatus
source: Failed to update status. Please try again.
fr: Échec de la mise à jour du statut. Veuillez réessayer.

# plusOneKillRecorded
source: +1 Kill recorded
fr: +1 élimination enregistrée

source: Failed to add kill
fr: Échec de l'ajout de l'élimination

# plusOneKill
source: +1 Kill
fr: +1 élimination

# squadCodeCopied
source: Squad code copied to clipboard
fr: Code d'escouade copié dans le presse-papiers

source: Close
fr: Fermer

# selectColorTitle
source: Select a Color
fr: Sélectionner une couleur

source: Select
fr: Sélectionner

# createSquadTitle
source: Create squad
fr: Créer une escouade

source: Submit
fr: Envoyer

# noRecentSquads
source: No recent squads available
fr: Aucune escouade récente disponible

# lastJoinedPrefix
source: Last joined:
fr: Dernière connexion :

# squadSelectionTitle
source: Squad Selection
fr: Sélection de l'escouade

source: Join a squad
fr: Rejoindre une escouade

source: Create a squad
fr: Créer une escouade

# joinSquadTitle
source: Join squad
fr: Rejoindre une escouade

# noBattleLogs
source: No battle logs yet
fr: Aucun journal de bataille pour l'instant

# youAreNowHost
source: You are now the host
fr: Vous êtes maintenant l'hôte

# youAreNoLongerHost
source: You are no longer the host
fr: Vous n'êtes plus l'hôte

# squadNameHint
source: Squad name
fr: Nom de l'escouade

source: Squad Lobby
fr: Salon de l'escouade

source: No active game
fr: Aucune partie en cours

source: Leave Squad
fr: Quitter l'escouade

source: Game started
fr: Partie démarrée

source: Game ended
fr: Partie terminée

# failedToStartGame
source: Failed to start game: {error}
fr: Échec du démarrage de la partie : {error}

# failedToEndGame
source: Failed to end game: {error}
fr: Échec de la fin de la partie : {error}

# failedToKickUser
source: Failed to kick user: {error}
fr: Échec de l'exclusion : {error}

# failedToSetHost
source: Failed to set user as host: {error}
fr: Échec de la définition de l'hôte : {error}

# hostTransferredTo
source: Host transferred to {username}
fr: Hôte transféré à {username}

# failedToLeaveSquad
source: Failed to leave squad: {error}
fr: Échec du départ de l'escouade : {error}

# inviteToSquadTitle
source: Invite to Squad
fr: Inviter dans l'escouade

# inviteToSquadBody
source: Share this code with users to join the squad:
fr: Partagez ce code pour rejoindre l'escouade :

source: Add New Member
fr: Ajouter un membre

# recentSquadsTitle
source: Recent Squads
fr: Escouades récentes

# joinedSquadSuccess
source: Joined squad successfully!
fr: Escouade rejointe avec succès !

source: Failed to join squad
fr: Échec de la connexion à l'escouade

# errorPrefix
source: Error:
fr: Erreur :

source: Turn torch on
fr: Allumer la lampe

source: Turn torch off
fr: Éteindre la lampe

source: Undo
fr: Annuler
